Router(config)#int gi0/1
Router(config-if)#ip address 10.1.1.1 255.255.255.0
*Jul 21 00:15:45.876: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
Router(config-if)#int lo0
*Jul 21 00:15:52.841: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip address 1.1.1.1 255.255.255.255
Router(config-if)#end
Router#show ip interface brief | i up
GigabitEthernet0/1         10.1.1.1        YES manual up                    up
Loopback0                  1.1.1.1         YES manual up                    up
Router(config)#router bgp 100
Router(config-router)#neighbor 10.1.1.2 remote-as 100
Router(config-router)#end

Router#show ip bgp summary
BGP router identifier 1.1.1.1, local AS number 100
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.1.2        4          100       0       0        1    0    0 never    Idle
Router#
*Jul 21 00:20:30.927: %BGP-5-ADJCHANGE: neighbor 10.1.1.2 Up
Router#show ip bgp summary
BGP router identifier 1.1.1.1, local AS number 100
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.1.2        4          100       4       4        1    0    0 00:00:44        0
