Router#show ip bgp
% BGP not active

Router#config t
Router(config)#int gi0/1
Router(config-if)#ip address 10.1.1.2 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int lo0
Router(config-if)#ip address 2.2.2.2 255.255.255.255
Router(config-if)#
Router(config-if)#end
Router#show ip interface brief | i up
GigabitEthernet0/1         10.1.1.2        YES manual up                    up
Loopback0                  2.2.2.2         YES manual up                    up
Router#config
Configuring from terminal, memory, or network [terminal]? t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 100
Router(config-router)#neighbor 10.1.1.1 remote-as 100
Router(config-router)#end
Router#
*Jul 21 00:20:29.221: %SYS-5-CONFIG_I: Configured from console by console
Router#config
*Jul 21 00:20:30.816: %BGP-5-ADJCHANGE: neighbor 10.1.1.1 U

Router#show ip bgp summary
BGP router identifier 2.2.2.2, local AS number 100
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.1.1        4          100       4       4        1    0    0 00:00:18        0
Router#show ip bgp summary
BGP router identifier 2.2.2.2, local AS number 100
BGP table version is 1, main routing table version 1

