R1- Config
SSH-Config
R1#				configure terminal
R1(config)#		hostname R1
R1(config)#		ip domain-name domain.com
R1(config)#		crypto key generate rsa
How many bits in the modulus [512]: 2048

R1(config)#			ip ssh version 2
R1(config)#			line vty 0 4
R1(config-line)#	transport input ssh telnet
R1(config-line)#	login local
R1(config-line)#	username bkoppad password cisco
R1(config)#			enable password cisco

Interface - config
R1(config)#		int gi0/0
R1(config-if)#	ip address 10.1.1.10 255.255.255.0
R1(config-if)#	no shutdown


==== With above config ssh loging is enabled =====


=== BGP configuration =====
R1(config)#				show ip int br | i up
R1(config)#				show ip protocol
R1(config)#				int gi0/1
R1(config-if)#ip add 10.1.1.11 255.255.255.0
% 10.1.1.0 overlaps with GigabitEthernet0/0
% 10.1.1.0 overlaps with GigabitEthernet0/0
R1(config-if)#			ip add 10.11.11.11 255.255.255.0
R1(config-if)#no shutdown

R1(config-if)#			int lo0
R1(config-if)#			ip address 1.1.1.1 255.255.255.255


R1#			show ip int br | i up
GigabitEthernet0/0         10.1.1.10       YES manual up                    up
GigabitEthernet0/1         10.11.11.11     YES manual up                    up
Loopback0                  1.1.1.1         YES manual up                    up

R1#show cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone,
                  D - Remote, C - CVTA, M - Two-port Mac Relay

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R2.domain.com    Gig 0/1           161              R B             Gig 0/1
R2.domain.com    Gig 0/0           163              R B             Gig 0/0

R1#show ip bgp
% BGP not active

R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router bgp 100

R1(config-router)#neighbor 10.22.22.22 remote-as 200



















